"""Последовательностью Фибоначчи называется последовательность 
чисел a0, a1, ..., an, ..., где 
a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).
Требуется найти N-е число Фибоначчи"""
#    a   b
# 0, |1, 1|, 2, 3, 5, 8...
# -----------------
# Решение с использованием for
def fib_for(n):
    a, b = 0, 1
    for _ in range(n):  # _ - так как переменная не используется
        a, b = b, a + b  # Обмен значениями
    return a

print(fib_for(5))

# -----------------
# Решение через рекурсию
def fib_2(n):
    if n <= 1:
        return n
    return fib_2(n - 1) + fib_2(n - 2)


def fib_2(n):
    return n if n <= 1 else fib_2(n - 1) + fib_2(n - 2)

print(fib_2(5))


    
